In [2]:
import numpy as np
import pandas as pd

In [3]:
dict1={ "name":["Prakhar","Kartik","Udit"], "marks":[43,66,86], "City":["Delhi","Jammu","Kanpur"]}

In [4]:
df=pd.DataFrame(dict1)

In [5]:
df

      name  marks    City
0  Prakhar     43   Delhi
1   Kartik     66   Jammu
2     Udit     86  Kanpur

In [6]:
df.to_csv('Students.csv') #Convert a Dataframe to a comma seprated values(CSV) Excel file

In [7]:
df.to_csv('Std.csv', index=False)

In [8]:
df.head(2)

      name  marks   City
0  Prakhar     43  Delhi
1   Kartik     66  Jammu

In [9]:
df.tail(2)

     name  marks    City
1  Kartik     66   Jammu
2    Udit     86  Kanpur

In [10]:
df.describe()

           marks
count   3.000000
mean   65.000000
std    21.517435
min    43.000000
25%    54.500000
50%    66.000000
75%    76.000000
max    86.000000

In [14]:
df['name'][1]="Shovit"

C:\Users\DELL\AppData\Local\Temp\ipykernel_21052\1831282438.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['name'][1]="Shovit"
C:\Users\DELL\AppData\Local\Temp\ipykernel_21052\1831282438.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][1]="Shovit"

In [15]:
df

      name  marks    City
0  Prakhar     43   Delhi
1   Shovit     66   Jammu
2     Udit     86  Kanpur

In [16]:
df.loc[2,'marks']=97
df

      name  marks    City
0  Prakhar     43   Delhi
1   Shovit     66   Jammu
2     Udit     97  Kanpur

In [17]:
df.index=['first','second','third']
df

           name  marks    City
first   Prakhar     43   Delhi
second   Shovit     66   Jammu
third      Udit     97  Kanpur